IDEA StatiCa Open Model
RebarSingle.RotationXrad Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Returns the rotation (in radians) of the rebar geometry (RebarShape). It is an angle of rotation around AxisX of the reference line.
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double RotationXrad { get; set; }
Public Property RotationXrad As Double
	Get
	Set
public:
property double RotationXrad {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
RebarSingle Class
IdeaRS.OpenModel.Model Namespace